ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p55x_mem_cfg_regs.xml
	<register id="LSxACCPROT0" width="32" page="1" offset="0x28" internal="0" description="Local Shared RAM Config Register 0">
		<bitfield id="FETCHPROT_LS0" description="Fetch Protection For LS0 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS0" description="CPU WR Protection For LS0 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS1" description="Fetch Protection For LS1 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS1" description="CPU WR Protection For LS1 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS2" description="Fetch Protection For LS2 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS2" description="CPU WR Protection For LS2 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS3" description="Fetch Protection For LS3 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS3" description="CPU WR Protection For LS3 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxACCPROT1" width="32" page="1" offset="0x2a" internal="0" description="Local Shared RAM Config Register 1">
		<bitfield id="FETCHPROT_LS4" description="Fetch Protection For LS4 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS4" description="CPU WR Protection For LS4 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS5" description="Fetch Protection For LS5 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS5" description="CPU WR Protection For LS5 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS6" description="Fetch Protection For LS6 RAM" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS6" description="CPU WR Protection For LS6 RAM" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS7" description="Fetch Protection For LS7 RAM" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS7" description="CPU WR Protection For LS7 RAM" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxACCPROT2" width="32" page="1" offset="0x2c" internal="0" description="Local Shared RAM Config Register 2">
		<bitfield id="FETCHPROT_LS8" description="Fetch Protection For LS8 RAM" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS8" description="CPU WR Protection For LS8 RAM" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FETCHPROT_LS9" description="Fetch Protection For LS9 RAM" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRPROT_LS9" description="CPU WR Protection For LS9 RAM" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxTEST" width="32" page="1" offset="0x30" internal="0" description="Local Shared RAM TEST Register">
		<bitfield id="TEST_LS0" description="Selects the different modes for LS0 RAM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS1" description="Selects the different modes for LS1 RAM" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS2" description="Selects the different modes for LS2 RAM" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS3" description="Selects the different modes for LS3 RAM" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS4" description="Selects the different modes for LS4 RAM" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS5" description="Selects the different modes for LS5 RAM" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS6" description="Selects the different modes for LS6 RAM" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS7" description="Selects the different modes for LS7 RAM" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS8" description="Selects the different modes for LS8 RAM" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="TEST_LS9" description="Selects the different modes for LS9 RAM" begin="19" end="18" width="2" rwaccess="RW"/>
	</register>
	<register id="LSxINIT" width="32" page="1" offset="0x32" internal="0" description="Local Shared RAM Init Register">
		<bitfield id="INIT_LS0" description="RAM Initialization control for LS0 RAM." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS1" description="RAM Initialization control for LS1 RAM." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS2" description="RAM Initialization control for LS2 RAM." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS3" description="RAM Initialization control for LS3 RAM." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS4" description="RAM Initialization control for LS4 RAM." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS5" description="RAM Initialization control for LS5 RAM." begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS6" description="RAM Initialization control for LS6 RAM." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS7" description="RAM Initialization control for LS7 RAM." begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS8" description="RAM Initialization control for LS8 RAM." begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INIT_LS9" description="RAM Initialization control for LS9 RAM." begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="LSxINITDONE" width="32" page="1" offset="0x34" internal="0" description="Local Shared RAM InitDone Status Register">
		<bitfield id="INITDONE_LS0" description="RAM Initialization status for LS0 RAM." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS1" description="RAM Initialization status for LS1 RAM." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS8" description="RAM Initialization status for LS8 RAM." begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="INITDONE_LS9" description="RAM Initialization status for LS9 RAM." begin="9" end="9" width="1" rwaccess="R"/>
	</register>
	<register id="LSxRAMTEST_LOCK" width="32" page="1" offset="0x36" internal="0" description="Lock register to LSx RAM TEST registers">
		<bitfield id="LS0" description="LSxTEST.TEST_LS0 LOCK" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LS1" description="LSxTEST.TEST_LS1 LOCK" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LS2" description="LSxTEST.TEST_LS2 LOCK" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="LS3" description="LSxTEST.TEST_LS3 LOCK" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LS4" description="LSxTEST.TEST_LS4 LOCK" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LS5" description="LSxTEST.TEST_LS5 LOCK" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LS6" description="LSxTEST.TEST_LS6 LOCK" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LS7" description="LSxTEST.TEST_LS7 LOCK" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LS8" description="LSxTEST.TEST_LS8 LOCK" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LS9" description="LSxTEST.TEST_LS9 LOCK" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to enable write to lock" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
